zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_ospi.c
			const struct jesd216_erase_type *erase_types =
							dev_data->erase_types;
			const struct jesd216_erase_type *bet = NULL;

			for (uint8_t ei = 0;
				ei < JESD216_NUM_ERASE_TYPES; ++ei) {
				const struct jesd216_erase_type *etp =
							&erase_types[ei];

				if ((etp->exp != 0)
				    && SPI_NOR_IS_ALIGNED(addr, etp->exp)
				    && (size >= BIT(etp->exp))
				    && ((bet == NULL)
					|| (etp->exp > bet->exp))) {
					bet = etp;
				}
			}

			if (bet != NULL) {
				/* In OPI mode, do not use the SFDP SPI opcode (bet->cmd). */
				if (dev_cfg->data_mode == OSPI_OPI_MODE) {
					cmd_erase.Instruction = SPI_NOR_OCMD_SE;
				} else {
					cmd_erase.Instruction = bet->cmd;
				}
			} else {
				/* Use the default sector erase cmd */
				if (dev_cfg->data_mode == OSPI_OPI_MODE) {
					cmd_erase.Instruction = SPI_NOR_OCMD_SE;
				} else {
					cmd_erase.Instruction = (stm32_ospi_hal_address_size(dev) ==
						HAL_OSPI_ADDRESS_32_BITS)
						? SPI_NOR_CMD_SE_4B
						: SPI_NOR_CMD_SE;
				}
			}

			LOG_DBG("Sector/Block Erase addr 0x%x, asize 0x%x amode 0x%x  instr 0x%x",
				cmd_erase.Address, cmd_erase.AddressSize,
				cmd_erase.AddressMode, cmd_erase.Instruction);

			ospi_send_cmd(dev, &cmd_erase);

			if (bet != NULL) {
				addr += BIT(bet->exp);
				size -= BIT(bet->exp);
			} else {
				addr += SPI_NOR_SECTOR_SIZE;
				size -= SPI_NOR_SECTOR_SIZE;
			}

			ret = stm32_ospi_mem_ready(dev_data, dev_cfg->data_mode,
						dev_cfg->data_rate);
		}
	}
	goto end_erase;

end_erase:
	ospi_unlock_thread(dev);

	return ret;
}

/* Function to read the flash with possible OSPI/SPI and STR/DTR */
static int flash_stm32_ospi_read(const struct device *dev, off_t addr,
				 void *data, size_t size)
{
	int ret = 0;

	if (!ospi_address_is_valid(dev, addr, size)) {
		LOG_ERR("Error: address or size exceeds expected values: "
			"addr 0x%lx, size %zu", (long)addr, size);
		return -EINVAL;
	}

	/* Ignore zero size read */
	if (size == 0) {
		return 0;
	}

#ifdef CONFIG_FLASH_STM32_NOR_MEMMAP
	/* If not MemMapped then configure it */
	if (!stm32_ospi_is_memorymap(dev)) {
		if (stm32_ospi_set_memorymap(dev) != 0) {
			LOG_ERR("READ failed: cannot enable MemoryMap");
			return -EIO;
		}
	}
	/* Now in MemMapped mode : read with memcopy */
	LOG_DBG("MemoryMapped Read offset: 0x%lx, len: %zu",
		(long)(STM32_OSPI_BASE_ADDRESS + addr),
		size);
	memcpy(data, (uint8_t *)STM32_OSPI_BASE_ADDRESS + addr, size);

#else /* CONFIG_FLASH_STM32_NOR_MEMMAP */
	const struct flash_stm32_ospi_config *dev_cfg = dev->config;
	struct flash_stm32_ospi_data *dev_data = dev->data;


	OSPI_RegularCmdTypeDef cmd = ospi_prepare_cmd(dev_cfg->data_mode, dev_cfg->data_rate);

	if (dev_cfg->data_mode != OSPI_OPI_MODE) {
		switch (dev_data->read_mode) {
		case JESD216_MODE_112: {
			cmd.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
			cmd.DataMode = HAL_OSPI_DATA_2_LINES;
			break;
		}
		case JESD216_MODE_122: {
			cmd.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_OSPI_ADDRESS_2_LINES;
			cmd.DataMode = HAL_OSPI_DATA_2_LINES;
			break;
		}
		case JESD216_MODE_114: {
			cmd.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
			cmd.DataMode = HAL_OSPI_DATA_4_LINES;
			break;
		}
		case JESD216_MODE_144: {
			cmd.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_OSPI_ADDRESS_4_LINES;
			cmd.DataMode = HAL_OSPI_DATA_4_LINES;
			break;
		}
		default:
			/* use the mode from ospi_prepare_cmd */
			break;
		}
	}

	/* Instruction and DummyCycles are set below */
	cmd.Address = addr; /* AddressSize is 32bits in OPSI mode */
	cmd.AddressSize = stm32_ospi_hal_address_size(dev);
	/* DataSize is set by the read cmd */

	/* Configure other parameters */
	if (dev_cfg->data_rate == OSPI_DTR_TRANSFER) {
		/* DTR transfer rate (==> Octal mode) */
		cmd.Instruction = SPI_NOR_OCMD_DTR_RD;
		cmd.DummyCycles = SPI_NOR_DUMMY_RD_OCTAL_DTR;
	} else {
		/* STR transfer rate */
		if (dev_cfg->data_mode == OSPI_OPI_MODE) {
			/* OPI and STR */
			cmd.Instruction = SPI_NOR_OCMD_RD;
			cmd.DummyCycles = SPI_NOR_DUMMY_RD_OCTAL;
		} else {
			/* use SFDP:BFP read instruction */
			cmd.Instruction = dev_data->read_opcode;
			cmd.DummyCycles = dev_data->read_dummy;
			/* in SPI and STR : expecting SPI_NOR_CMD_READ_FAST_4B */
		}
	}

	LOG_DBG("OSPI: read %zu data", size);
	ospi_lock_thread(dev);

	ret = ospi_read_access(dev, &cmd, data, size);

	ospi_unlock_thread(dev);

#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP */
	return ret;
}

/*
 * Function to write the flash (page program) : with possible OSPI/SPI and STR/DTR
 * NOTE: writing  in MemoryMapped mode is not guaranteed
 */
static int flash_stm32_ospi_write(const struct device *dev, off_t addr,
				  const void *data, size_t size)
{
	const struct flash_stm32_ospi_config *dev_cfg = dev->config;
	struct flash_stm32_ospi_data *dev_data = dev->data;
	size_t to_write;
	int ret = 0;

	if (!ospi_address_is_valid(dev, addr, size)) {
		LOG_ERR("Error: address or size exceeds expected values: "
			"addr 0x%lx, size %zu", (long)addr, size);
		return -EINVAL;
	}

	/* Ignore zero size write */
	if (size == 0) {
		return 0;
	}

	ospi_lock_thread(dev);

#ifdef CONFIG_FLASH_STM32_NOR_MEMMAP
	if (stm32_ospi_is_memorymap(dev)) {
		/* Abort ongoing transfer to force CS high/BUSY deasserted */
		ret = stm32_ospi_abort(dev);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped access before write");
			goto end_write;
		}
	}
	/* Continue with Indirect Mode */
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP */
	/* page program for STR or DTR mode */
	OSPI_RegularCmdTypeDef cmd_pp = ospi_prepare_cmd(dev_cfg->data_mode, dev_cfg->data_rate);

	/* using 32bits address also in SPI/STR mode */
	cmd_pp.Instruction = dev_data->write_opcode;

	/* Adapt lines based on write_opcode */
	switch (cmd_pp.Instruction) {
	case SPI_NOR_CMD_PP_4B:
		__fallthrough;
	case SPI_NOR_CMD_PP:
		cmd_pp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_pp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_pp.DataMode = HAL_OSPI_DATA_1_LINE;
		break;
	case SPI_NOR_CMD_PP_1_1_2:
		cmd_pp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_pp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_pp.DataMode = HAL_OSPI_DATA_2_LINES;
		break;
	case SPI_NOR_CMD_PP_1_1_4_4B:
		__fallthrough;
	case SPI_NOR_CMD_PP_1_1_4:
		cmd_pp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_pp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_pp.DataMode = HAL_OSPI_DATA_4_LINES;
		break;
	case SPI_NOR_CMD_PP_1_4_4_4B:
		__fallthrough;
	case SPI_NOR_CMD_PP_1_4_4:
#if defined(CONFIG_USE_MICROCHIP_QSPI_FLASH_WITH_STM32)
		/* Microchip QSPI flash uses PP_1_1_4 opcode for the PP_1_4_4 operation */
		cmd_pp.Instruction = SPI_NOR_CMD_PP_1_1_4;
#endif /* CONFIG_USE_MICROCHIP_QSPI_FLASH_WITH_STM32 */
		cmd_pp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_pp.AddressMode = HAL_OSPI_ADDRESS_4_LINES;
		cmd_pp.DataMode = HAL_OSPI_DATA_4_LINES;
		break;
	default:
		/* Use lines based on data mode set in ospi_prepare_cmd */
		break;
	}

	cmd_pp.Address = addr;
	cmd_pp.AddressSize = stm32_ospi_hal_address_size(dev);
	cmd_pp.DummyCycles = 0U;

	LOG_DBG("OSPI: write %zu data", size);

